[
  {
    "type": "حمد",
    "typeEng": "hamd",
    "subject": "حمدِ باری تعالیٰ",
    "poet": "علامہ محمد اقبالؔ",
    "lines": [
      "خودی کا سّرِ  نہاں  لا لہٰ الا اللہ",
      "خودی سے تیغ فساں  لا لہٰ الا اللہ",
      "",
      "یہ دور اپنے براھیم کی تلاش میں ہے",
      "صنم کدہ ہے جہاں لا لہٰ الا اللہ",
      "",
      "اگرچہ بت ہیں جماعت کی آستینوں میں",
      "مجھے ہے حکمِ اذاں لا لہٰ الا اللہ",
      "",
      "یہ نغمہ فصلِ گل و لا لہ کا نہیں پابند",
      "بہار ہو کے خزاں لا لہٰ الا اللہ",
      "",
      "کیا ہے  تو نے متاعِ غرور کا سودا",
      "فریبِ سود و زیاں لا لہٰ الا اللہ",
      ""
    ]
  },
  {
    "type": "حمد",
    "typeEng": "hamd",
    "subject": "حمدِ باری تعالیٰ",
    "poet": "غلام رسول قادری نصیرؔ",
    "lines": [
      "حسبی ربی جل اللہ مافی قلبی غیر اللہ",
      "نورِ محمد صل اللہ لا لہٰ الا اللہ",
      "",
      "اول و آخر ہے اللہ باطن و ظاہر ہے اللہ",
      "حافظ و ناصر ہے اللہ لا لہٰ الا اللہ",
      "",
      "دیکھتے کیا ہو اہلِ صفا آ پہنچے محبوبِ خدا",
      "یعنی  ہو چکے جلوہ نما لا لہٰ الا اللہ",
      "",
      "کون و مکاں میں ہے اللہ دونوں جہاں میں ہے اللہ",
      "جسم میں جاں میں ہے اللہ لا لہٰ الا اللہ",
      "",
      "اعلیٰ جس کی ذات وہی اعلیٰ جس کی صفات وہی",
      "رکھ لی جس نے بات وہی لا لہٰ الا اللہ",
      "",
      "حسبی ربی جس نے کہا فیض کے دریا کو پایا",
      "گوہرِ مقصد ہاتھ آیا لا لہٰ الا اللہ",
      "",
      "کھل جائیں در جنت کے دوذخ کی سب آگ بجھے",
      "دل سے کوئی اک بار کہے لا لہٰ الا اللہ",
      "",
      "عرضِ غلام فقیر ہے اب داخلِ رحمت ہوں ہم سب",
      "ذکر قبول ہو یہ یا رب  لا لہٰ الا اللہ",
      ""
    ]
  },
  {
    "type": "حمد",
    "typeEng": "hamd",
    "subject": "حمدِ باری تعالیٰ",
    "poet": "لطیف اثرؔ",
    "lines": [
      "لا الہٰ الا ہو، لا الہٰ الا ہو",
      "ایک طلب ہے ایک ہی خو لا الہٰ الا ہو",
      "اب تُو ہے تُو اور تُو ہی تُو لا الہٰ الا ہو",
      "",
      "تیری عبادت کیا کہنا، تیری حقیقت کیا کہنا",
      "ہوگئی دنیا قبلہ رُو لا الہٰ الا ہو",
      "",
      "اٹھ گئے آنکھوں سے پردے راز کھلے سب جلوؤں کے",
      "مجھ سے اب کیا دور ہے تُو لا الہٰ الا ہو",
      "",
      "مجھ کو اپنی ہستی کا، چل جائے گا ایک روز پتہ",
      "سامنے جب ہو میرے تو لا الہٰ الا ہو",
      "",
      "تجھ کو دیکھا ہے اکثر تجھ کو سنا ہے ان کو سُن کر",
      "تجھ میں ہیں وہ اور ان میں تُو لا الہٰ الا ہو",
      "",
      "صّل علیٰ سے گونج اُٹھی تیرے حرم کی آج فضا",
      "آئی مدینے کی خوشبو لا الہٰ الا ہو",
      "",
      "تیرے حبیب کے صدقے میں در تک تیرے پہنچا ہے",
      "دل میں اثرؔ کے تیری خُو لا الہٰ الا ہو"
    ]
  }
]